// 1) კომენტარებით ახსენით რა არის ფუნქცია.

// 2) შექმენი ფუნქცია რომელსაც გადაეცემა ორი პარამეტრი, თქვენი დავალებააა გამოიტანოთ პირველი რიცხვი აკვადრატებული მეორე რიცხვზე.

// 3) კომენტარის სახით ახსენით, რა განსხვავებაა ჩვეულებრივ ფუნქციას (Regular Function) და Arrow Function-ს შორის JavaScript-ში.

// 1
// ფუნქცია არის მრავალჯერ განმეორებადი კოდის ბლოკი

// 2
function nums(num1,num2){
    return num1**num2
}

console.log(5,2)

// 3
// განსხვავება სტრუქცტურაშია და კოდის წერაშია
// regular function
// function test(testnum){...}

// arrow function
// const num = (testnum) => {...}