# 1) შექმენით ფუნქცია greet და დააბრუნეთ მისასალმებელი ტექსტი return ის საშუალებით

# 2) შექმენით ფუნქცია add რომელსაც გადაეცემა ორი რიცხვი და შემდეგ დააბრუნეთ მათი ჯამი


# 3) შექმენით ფუნქცია multiply რომელსაც გადაეცემა ორი რიცხვი  შემდეგ კი დააბრუნეთ მათი ნამრავლი

# 4) კომენტარებით ახსენით რა არის არგუმენტი და რა არის პარამეტრი,ასევე რატომ ვიყენებთ ფუნქციებს

# 5) შექმენი ფუნქცია სახელად filter რომელსაც გადაეცემა რიცხვი, თქვენი დავალებაა შეამოწმოთ ეს რიცხვი ლუწია თუ კენტი და დააბრუნოთ შესაბამისი შედეგი even ან odd

# --------------------------------------------------------------------------------------------------------------------------------------

#1
def greet():
    return "Hello"
print(greet())

#2
def add(a, b):
    return a+b
print(add(5,10))

#3
def multiply(x,y):
    return x*y
print(multiply(6,7))

#4
# არგუმენტი არის ფუნქციის გამოძახების დროს ფრჩხილებში გადაცემული მნიშვნელობა
# პარამეტრი არის ცვლადი რომელიც ფუნქციის გამოძახევისას მიიღებს არგუმენტის მნიშვნელობას
# ფუნქციებს ვიყენებთ იმისთვის რომ გავიმარტივოთ კოდი

#5
def filter (number):
    if number % 2 ==0:
        return "even"
    else:
        return "odd"
print(filter(8))
