# 1) ჩამოწერეთ აქამდე ნასწავლი ფუნქციები, თქვენი დავალებაა: დაწეროთ რომელი არ გამოიტანს ეროს თუ არგუმენტში არ გადავცემთ არაფერს. და რომელი გამოიტანს ერორს, აუცილებლად მოიყვანეთ მაგალითი და ახსენით დეტალურად.

# 2) კომენტარებით ახსენი როდის ვიყენებთ დოტნოტაციას(dot notation).

# 3) შექმენი ცვლადი სადაც შეინახავ შენს სახელს, რომელიც გეწერება პატარა ასოებით, გამოიყენე მეთოდი რომელიც გაადიდებს თქვენი სახელის ასოებს.

# 4) შექმენი ცვლადი სადაც შეინახავ შენი საყავრელი სპორტის სახელს დიდი ასოებით. გამოიყენე მეთოდი რომელიც დააპატარავებს.

# 5) შექმენი ცვლადი სადაც შეინახავთ თქვენს გვარს პატარა ასოებით. გამოიყენე მეთოდი რომელიც გაადიდებს მხოლოდ პირველ ასოს.

#1
# range()-გამოიტანს ერორს
# int()-არ გამოიტანს ერორს
# str()-არ გამოიტანს ერორს
# float()-არ გამოიტანს ერორს
# bool()-არ გამოიტანს ერორს
# .lower()-არ გამოიტანს ეროს
# .upper()-არ გამოიტანს ერორს
# .capitalize()-არ გამოიტანს ერორს
# find()-გამოიტანს ერორს

#2
# dotnotation - ვიყენებთ მაშინ როცა გვინდა რომ მივწვდეთ რომელიმე ან მეთოდს 

#3
name = "gega"
print(name.upper())

#4
my_favorite_sport = "FOOTBALL"
print(my_favorite_sport.lower())

#5
my_surname = "pirtskhelava"
print(my_surname.capitalize())