# 1)სიის ელემენტის ამოღება ინდექსით

# დაწერე სია: nums = [10, 20, 30, 40]
# მომხმარებელი შეიყვანს ინდექსს და პროგრამა დაბეჭდავს შესაბამის ელემენტს.

# თუ ინდექსი არ არსებობს → დაიჭირე შეცდომა და დაბეჭდე: "ასეთი ინდექსი არ არსებობს".
# -----------------------------------------------------------------------------------
# 2)ლექსიკონიდან (dict) მნიშვნელობის მიღება

# დაწერე dict: prices = {"apple": 2, "banana": 3}
# მომხმარებელი შეიყვანს პროდუქტს და დაბეჭდე ფასი prices[product].

# თუ ასეთი key არ არსებობს → დაიჭირე შეცდომა და დაბეჭდე: "ასეთი პროდუქტი ვერ მოიძებნა"(დაგჭირდებათ KeyError).

# ---------------------------------------------------------------------------------------------------------------
# 3)სტრინგის რიცხვად გადაყვანა + დამატება

# მომხმარებელი შეიყვანს ორ მნიშვნელობას x და y (როგორც ტექსტი).
# შენი მიზანია გადაიყვანო int-ად და დაბეჭდო ჯამი.

# თუ რომელიმე არ არის რიცხვი → "მხოლოდ რიცხვები შეიყვანე".


#1
nums = [10, 20, 30, 40]
try:
    index = int(input("შეიყვანეთ ინდექსი: "))
    print(nums[index])
except IndexError:
    print("ასეთი ინდექსი არ არსებობს")

#2
prices = {"apple": 2, "banana": 3}
try:
    product = input("შეიყვანეთ პროდუქტი: ")
    print(prices[product])
except KeyError:
    print("ასეთი პროდუქტი ვერ მოიძებნა")

#3
x = input("შეიყვანე რიცხვი: ")
y = input("შეიყვანე რიცხვი: ")
try:
    equals = int(x) + int(y)
    print(equals)
except ValueError:
    print("შეიყვანე მხოლოდ რიცხვები")

