# 1) კომენტარებით ახსენით რა არის ლოგიკური ოპერატორები.

# 2) შექმენით ფორ ციკლი და გამოიტანეთ ლუწი რიცხვები 1 დან 100-ამდე.

# 3) შექმენი Even_or_Odd ფუნქცია.

# 4) შექმენით თაფლი გადაეცით რამოდენიმე მნიშვნელობა იპოვეთ რამდენჯერ მეორდება 4-იანი და რომელ ინდექსზე დგას თქვენი სახელი.

# 5) კომენტარის სახით ახსენით რა არის სეტი და მოიყვანეთ მაგალითი.

# 6) შექმენით დიქშენერი გადაეცით თქვენი სახელი გვარი ასაკი, და საბოლოოდ დაბეჭდეთ მხოლოდ გასაღები.

#1
# ლოგიკური ოპერატორები არის and, or, not რომლებიც გამოიყენება ლოგიკური გამოთვლებისათვის.
# ისინი საშუალებას გვაძლევენ შევადაროთ და შევაფასოთ სხვადასხვა პირობები და გამოვიყენოთ ისინი პროგრამირების ლოგიკაში.

#2
for number in range(0, 101, 2):
    print(number)

#3
def Even_or_Odd(number):
    if number % 2 == 0:
        return "Even"
    else:
        return "Odd"
print(Even_or_Odd(10))  # Output: Even
print(Even_or_Odd(7))   # Output: Odd

#4
honey = (1, 2, 3, 4, 5, 4, 6, 7, "Gega", 4)
print(honey.count(4))
print(honey.index("Gega"))

#5
# სეტი არის მონაცემთა სტრუქტურა რომელიც შეიცავს უნიკალურ ელემენტებს. სეტში არ შეიძლება იყოს დუბლირებული მნიშვნელობები მას არ გააჩნია ინდექსები ანუ ყოველთვის მისი ელემენტების მდებარეობა შეიცვლება.
# მაგალითი:
my_set = {1, 2, 3, 4, 4, 5}
print(my_set) 
# Output: {1, 2, 3, 4, 5} - მეორედ 4 არ გამოვა რადგან სეტში არ შეიძლება იყოს ერთი და იგივე ელემენტები.

#6
my_dict = {
    "name": "Gega",
    "surname": "Pirtskhelava",
    "age": 15
}
print(my_dict.keys())

