// 1) მოიძიეთ ინფორმაცია event loop ზე და ახსენით კომენტარებით , ახსენით რა არის call stack და callback queue


// 2)მოიძიეთ ინფორმაცია რა არის API და დეტალურად ახსენით


// 3)სახელის დაბრუნება:
// დაწერე async ფუნქცია getUserName(), რომელიც უბრალოდ აბრუნებს სტრინგს "გიორგი". გამოიძახე ეს ფუნქცია და მიღებული შედეგი (Promise) დაბეჭდე .then()-ის საშუალებით.


// 4)მოიძიეთ ინფორმაცია try და catch ზე, მეც ვისაუბრებ ამაზე დეტალურად მაგრამ მაინც


// 5)await-ით ლოდინი
// დაწერე კოდი, რომელიც სიმულაციას გაუკეთებს მონაცემების წამოღებას:

// შექმენი ფუნქცია getData, რომელიც აბრუნებს Promise-ს. ეს Promise უნდა სრულდებოდეს 2 წამის შემდეგ და აბრუნებდეს რიცხვს 100.

// შექმენი მეორე ფუნქცია processData, რომელიც იქნება async.

// processData-ს შიგნით გამოიყენე await, რომ დაელოდო getData-ს შედეგს, გაამრავლო ის 2-ზე და დაბეჭდო კონსოლში.

// 1
// Call Stack (ძახილების სტეკი): ეს არის ადგილი, სადაც ინახება შესასრულებელი კოდის ხაზები. მუშაობს პრინციპით LIFO (Last In, First Out — ბოლო შედის, პირველი გამოდის). როცა ფუნქციას ვიძახებთ, ის თავსდება სტეკის თავში, ხოლო როცა ფუნქცია მუშაობას დაასრულებს, სტეკიდან ვარდება.

// Callback Queue (უკუკავშირის რიგი): აქ თავსდება ის ასინქრონული ფუნქციები (Callback-ები), რომლებიც უკვე მზად არის შესასრულებლად (მაგალითად, -მა დაასრულა დროის ათვლა). მუშაობს პრინციპით FIFO (First In, First Out — პირველი შედის, პირველი გამოდის).setTimeout

// Event Loop (მოვლენათა ციკლი): ეს არის ერთგვარი "მორიგე", რომელიც განუწყვეტლივ ამოწმებს კოდის მიმდინარეობას. მისი ერთადერთი დავალებაა: თუ Call Stack ცარიელია, მან უნდა აიღოს პირველივე ფუნქცია Callback Queue-დან და გადაიტანოს Call Stack-ში შესასრულებლად.

// 2
// API (აპლიკაციის პროგრამირებადი ინტერფეისი) არის წესებისა და პროტოკოლების ერთობლიობა, რომელიც საშუალებას აძლევს სხვადასხვა პროგრამულ უზრუნველყოფას (აპლიკაციებს) დაუკავშირდნენ ერთმანეთს და გაცვალონ მონაცემები.

// 3
async function getUserName() {
  return "გიორგი"
}

getUserName().then((name) => {
  console.log(name)
})

// 4
// try ბლოკი: აქ ვწერთ კოდს, რომლის შესრულებაც გვსურს, მაგრამ არსებობს რისკი, რომ რაიმე შეცდომა მოხდეს (მაგალითად, სერვერიდან მონაცემები ვერ წამოვიდეს, ან არარსებულ ცვლადს მივმართოთ).

// catch ბლოკი: ეს ბლოკი სრულდება მხოლოდ იმ შემთხვევაში, თუ  ბლოკში კოდის გაშვებისას რაიმე შეცდომა მოხდა.  იღებს ამ შეცდომის ობიექტს, სადაც წერია, თუ რამ გამოიწვია პრობლემა.trycatch(error)

// 5
function getData() {
  return new Promise((resolve) => {
    setTimeout(() => {
      resolve(100)
    }, 2000)
  })
}

async function processData() {
  console.log("ველოდებით მონაცემებს...")

  const result = await getData()
  
  const multipliedResult = result * 2
  console.log("შედეგი:", multipliedResult)
}

processData()