# 1)შექმენით სია სადაც გექნებათ რიცხვები მოცემული და 

# ახალ სიაში ჩაამატეთ ისეთი რიცხვები რომლებიც იყოფა 3ზეც და 5 ზეც

# 2)შექმენით სია სადაც გექნებათ მოცემული სახელები, შემდეგ ახალ სიაში ჩაამატეთ ისეთი სახელები სახელები რომლის სიმბოლოების რაოდენობაც არის ლუწი რიცხვი

# 3) ახსენით კომენტარებით რაში გვჭირდება list comprehension


#1
nums = [5, 8, 10, 14, 17, 15, 30]
new_nums = [i for i in nums if i % 3 == 0 and i % 5 == 0]
print(new_nums)

#2
names = ["Gega", "Gio", "Luka", "Nika", "Giorgi"]
new_names = [i for i in names if len(i) % 2 == 0]
print(new_names)

#3
#list comprehension გვჭირდება იმაში რომ კოდმა არ დაიკავოს დიდი ადგილი vscode ში და თავიდან ავირიდოთ დიდი და გრძელი კოდების წერა