# 1)გამოიტანეთ თქვენი სახელი და გვარი იმდენჯერ, რამდენი წლისაც ხართ

# 2)გამოიტანეთ ტერმინალში რიცხვები 1-დან 20-ის ჩათვლით

# 3)გამოიტანეთ ტერმინალში რიცხვები 20-დან 0-მდე

# ამ დავალებების შესასრულებლად გამოიყენეთ for loop-ი

# whiile loops:

# 1)გამოიტანეთ რიცხვები 10-დან 15-მდე
# 2)გამოიტანეთ რიცხვები 50-დან 0-მდე
# 3)გამოიტანეთ მხოლოდ ლუწი რიცხვები 10-დან 70-მდე
# 4)გამოიტანეთ კენტი რიცხვები 25-დან 55-მდე


# 1
# age = 15
# name = "Gega Pirtskhelava" 

# for _ in range(age):
#     print(name)

# #2
# for i in range(1, 21):
#     print(i)

# #3
# for i in range(20, -1, -1):
#     print(i)

# # While loops:

# #1
# i = 10

# while i <= 15:
#     print(i)
#     i = i + 1

# #2
# i = 50

# while i >= 0:
#     print(i)
#     i = i - 1

# #3
# i = 10

# while i <= 70:
#     print(i)
#     i += 2


# #4
# i = 25

# while i <= 55:
#     print(i)
#     i += 2


# 1) მომხმარებელს შემოატანინინე 1 დან 20 ამდე ნებისმიერი რიცხვი. თუ მომხმარებლის შემოყვანილი რიცხვი ნაკლებია 10 ზე ან მეტია ოცზე მაშინ დაპრინტე "good". ხოლო სხვა შემთხვევაში დაპრინტე "bad".

# 2) კომენტარებით ახსენით რას აკეთებს if, elif, else.

# 3) მომხმარებელს შემოატანინე შენი ასაკი. თუ შენი ასაკი მეტია ან ტოლი 18 ზე მაშინ დაპრინტე "სრულწლოვანი". ხოლო სხვა შემთხვევაში დაპრინტე არასრულწლოვანი.

# 4) მომხმარებელს შემოატანინე ნებისმიერი რიცხვი. თუ მომხმარებლის შემოყვანილი რიცხვი იყოფა 2-ზე და ნაშთი რჩება 0-ი დაპრინტე Even. ხოლო სხვა შემთხვევაში დაპრინტე Odd.

# 5) მომხმარებელს შემოატანინე ქულა 1 დან 10-მდე თუ მომხმარებლის შეყვანილი ქულა მეტია ან ტოლი 8-ზე მაგ შემთხვევაში დაპრინტე "თქვენ წარმატებით ჩააბარეთ გამოცდა". ხოლო სხვა შემთხვევაში "თქვენ ჩაიჭერით.





