# 1) კომენტარებით ახსენი რა არის Slicing. და რაში ვიყენებთ.

# 2) შექმენი სია სადაც შეინახავ ოჯახის წევრების სახელებს. საბოლოოდ დაბრინტე პირველი სამი ელემენტი.

# 3) შექმენი სია სადაც შეინახავ ნებისმიერ მონაცემთა ტიპის მნიშვნელობას. საბოლოოდ დაბრინტე ბოლო ხუთი ელემენტი.

# 4) შექმენი ცვლადი სადაც შეინახავ შენს სახელს. და Slicing-ის დახმარებით დაბეჭდე შენი სახელის ბოლო სამი ასო.

# 5) მომხმარებელს შემოაყვანინე თავისი საყვარელი მანქანის სახელი. საბოლოოდ დაპრინტე მომხმარბლის შემოყვანილი მნიშვნელობიდან პირველი სამი ასო.


#1
# Slicing - არის მეთოდი რომლის საშუალებითაც შეგვიძლია სტრიქონების ან სიების ნაწილებად დაყოფა და კონკრეტული ელემენტების გამოღება. მას ვიყენებთ მაშინ როდესაც გვინდა სტრიქონის ან სიის მხოლოდ გარკვეული ნაწილი გამოვიტანოთ და გამოვიყენოთ.

#2
family_members = ["გეგა", "მათე", "ელმირა", "ჭაბუკა"]
print(family_members[0:3])

#3
mixed_list = [25, "hello", 3.14, True, "world", 42, False, "python"]
print(mixed_list[3:8])

#4
my_name = "გეგა"
print(my_name[1:4])

#5
car_name = input("enter your favorite car name:")
print(car_name[0:3])
