# 1) ახსენით თითოეული ერორის ტიპი:

# IndexError
# ValueError
# TypeError
# IndexError 
# KeyError(მოიძიეთ ინფო)
# ZeroDivisionError(მოიძიეთ ინფო)
# SyntaxError

# 2)შექმენით ორი ცვლადი a=5 და b=0 და try ბლოკში გააკეთე a/b და დაბეჭდე,დაიჭირეთ შესაბამისი ერორი except ის საშუალებით და დაუბეჭდეთ რომ "0ზე გაყოფა არ შეიძლება!"

#1
#IndexError - არის ერორი როცა ვცდილობთ მივწვდეთ ლისტის ისეთ ელემენტს რომელიც არ არსებობს
#ValueError - არის ერორი როცა ვცდილობთ ვაქციოთ ერთი ტიპის მონაცემი სხვა ტიპში
#TypeError - არის ერორი როცა ვცდილობთ გამოვიყენოთ ოპერაცია არასწორ ტიპზე
#KeyError - არის ერორი როცა ვცდილობთ მივწვდეთ დიქშენერის ისეთ ელემენტს რომელიც არ არსებობს
#ZeroDivisionError - არის ერორი როცა ვცდილობთ გავყოთ რიცხვი ნულზე რაც არ შეიძლება
#SyntaxError - არის ერორი როცა კოდში არის კოდის წერის წესი დარღვეული


#2
a = 5
b = 0
try:
    Result = a / b
    print(Result)
except ZeroDivisionError:
    print("0ზე გაყოფა არ შეიძლება!")