# 1) კომენტარის სახით ახსენით რა მასალაც გადავიმეორეთ დღეს პითონში და მოიყვანეთ თითო-თითო მაგალითი.

#1
#and - ოპერატორი ტერმინალში გამოიტანს True-ს იმ შემთხვევაში თუ ორივე მნიშნვნელობა არის მართალი
print(12>5 and 10<12) #> True 
#or - ოპერატორი ტერმინალში გამოიტანს True-ს იმ შემთხვევაში თუ ერთ-ერთი მნიშნვნელობა არის მართალი
print(20<10 or 10<8) #> False
#not - გააკეთეს იმის საწინააღმდეგოს რაც წერია მნიშვნელობად
print(not True) #> False

#if - მნიშვნელობით ჩვენ ვამოწმებთ იმას რასაც დავწერთ
age = 15
if age < 6:
    print("newbie")
#elif - თუ if ვერ გაიარა მაშინ შეიძლება გაიაროს elif ში რასაც ჩავწერთ
elif age < 18:
    print("puberty")
#else - ეს არის ყველა სხვა შემთხვევა
else:
    print("adult")

# > - ამოწმებს თუ არა მეტია ერთი რიცხვი მეორეზე
print(5 > 2)
# < - ამოწმებს თუ არა ნაკლებია ერთი რიცხვი მეორეზე
print(7 < 10)
# == - ამოწმებს უდრის თუ არა ერთი მეორეს
print(5 == 5)
# >= - უდრის ან მეტია თუ არა
print(5 >= 3)
# <= - ნაკლებია ან უდრის
print(5 <= 7)
# != - ამოწმებს თუ არ უდრის ერთი რიცხვი მეორეს
print(5 != 7)

#set - სეტი არის რანდომად დაყენებული რაც არის ჩასმული სეტში და არ აქვს ინდექსები
sets = {1,"gega",7,True}

#list - ლისტი არის კოლექციის ტიპი რომელშიც შეგვიძლია შევინახოთ სხვადასხვა ტიპის მონაცემები
lst = [1,"gega",7,True]