// სინქრონიზაცია ნიშნავს როდესაც კოდი სრულდება თანმიმდევრობით ბლოკირების წესის მიხედვით ანუ სანამ პირველი ან ერთი დავალება არ შესრულდება იქამდე არ დაიწყება მომდევნო დავალება

// მაგ:
function greet() {
  console.log('Hello')
}

function introduce() {
  console.log('My name is John')
}

function sayGoodbye() {
  console.log('Goodbye')
}

greet()
introduce()
sayGoodbye()

// აქ თითოეული ფუნქცია გამოძახებულია თანმიმდევრობით სანამ პირველი გამოძახებული არ მორჩება იქამდე არ გადავა მეორეზე და მესამეზე

// ასინქრონიზაცია კი საშუალებას იძლევა ერთი დავალებიდან მეორეზე გადავიდეს P.S მარა ეს როგორ ხდება ვერ მივხვდი 
