# 1) მომხმარებელმა უნდა შეიყვანოს ორი რიცხვი.
# პროგრამამ უნდა დაბეჭდოს შედეგი — True, თუ ორივე დადებითია, ხოლო თუ ერთი მაინც არასწორი იქნება False.

# 2) შექმენი ორი ცვლადი ერთი email მეორე password ამ ორივე ცვლადს მიანიჭეთ შესაბამისი მნიშვნელობა. შემდეგ მომხმარებელს შემოატანინე ემაილი და პაროლი. საბოლოოდ დაბეჭდე თუ შენი ემაილი უდრის მომხმარებლის შემოყვანილ ემაილს და შენი პაროლი თუ უდრის მომხმარებლის შემოყვანილ პაროლს.

# 3) print(12==13 or 12==12 and 21>20) კომენტარებით მიუწერე რა იქნება შედეგი და თან ახსენი რატომ. არ ნახო შედეგი!




# number = int(input("enter a number: "))    
# number2 = int(input("enter a number2: "))

# print (number > 0 and number2 > 0)



# email = "gegapirt@gmail.com"
# password = "1234"

# email = input("enter email:")
# password = input("enter password:")





# 4) მომხმარებელს შემოატანინეთ მისი ასაკი და შეამოწმეთ არის თუ არა ის სრულწლოვანი

# 5)მომხმარებელს შემოატანინეთ მისი როლი(მაგ:admin, moderator, user) თუ აღმოჩნდა ადმინი დაბეჭდეთ True

# 6)კომენტარებით ახსენით რომელი შედარების და ლოგიკური ოპერატორები გვაქვს ახსენით თითოეული


age = int(input("enter age:"))
print (age > 18)


roll = input("enter your roll: ")
admin = input("enter your roll: ")
print (roll == admin)



# შედარების ოპერატორები:
# > განსაზღვრავს არის თუ არა ერთი რიცხვი მეორეზე მეტი
# < განსაზღვრავს არის თუ არა ერთი რიცხვი მეორეზე ნაკლები
# >= განსაზღვრავს არის თუ არა ერთი რიცხვი მეორეზე მეტი ან ტოლი
# <= განსაზღვრავს არის თუ არა ერთი რიცხვი მეორეზე ნაკლები ან ტოლი
# == განსაზღვრავს უდრის თუ არა რიცხვები ერთმანეთს
# != განსაზღვრავს თუ არ უდრის რიცხვები ერთმანეთს

# ლოგიკური ოპერატორები:
# or თუ
# and და
# not უარყოფა







