// 2
// GET (წაკითხვა/წამოღება): გამოიყენება სერვერიდან მონაცემების გამოსათხოვად. მაგალითად, როცა ბრაუზერში საიტის მისამართს წერ და "ენთერს" აჭერ, სერვერზე იგზავნება GET მოთხოვნა, რათა მან საიტის კოდი გამოგიგზავნოს. GET მოთხოვნას სერვერზე არაფერი არ გადააქვს და არ ცვლის.

// POST (შექმნა/გაგზავნა): გამოიყენება სერვერზე ახალი მონაცემების გასაგზავნად და შესაქმნელად. მაგალითად, როცა საიტზე რეგისტრაციას გადიხარ და ავსებ ფორმას (სახელი, პაროლი), ეს მონაცემები POST მოთხოვნით მიდის სერვერზე, რათა ბაზაში ახალი მომხმარებელი შეიქმნას.

// PUT (სრული განახლება): გამოიყენება სერვერზე არსებული მონაცემის სრულად შესაცვლელად/განასახლებლად. თუ მონაცემი არ არსებობს, PUT-მა შეიძლება ახალიც შექმნას. მაგალითად, პროფილის რედაქტირებისას, როცა ყველა ველს თავიდან ინახავ.

// PATCH (ნაწილობრივი განახლება): PUT-ის მსგავსია, თუმცა გამოიყენება მონაცემის მხოლოდ კონკრეტული ნაწილის შესაცვლელად. მაგალითად, თუ პროფილში მხოლოდ ტელეფონის ნომრის შეცვლა გსურს და სხვა ველებს არ ეხები.

// DELETE (წაშლა): სახელიდან გამომდინარე, გამოიყენება სერვერიდან კონკრეტული მონაცემის წასაშლელად. მაგალითად, საიტზე შენი პოსტის ან პროფილის გაუქმებისას. 

// 3
try {
  sayHello();
} catch (error) {
  console.log("სამწუხაროდ, ასეთი ფუნქცია არ არსებობს!")
}

console.log("კოდის გაშვება გრძელდება...")

// 4
function checkAge(age) {
  if (age < 18) {
    throw new Error("წვდომა აკრძალულია: მომხმარებელი არასრულწლოვანია!")
  } else {
    console.log("წვდომა დაშვებულია")
  }
}

try {
  console.log("ვამოწმებთ 15 წელ");
  checkAge(15)
} catch (error) {
  console.error("დაჭერილი შეცდომა:", error.message)
}

try {
  console.log("ვამოწმებთ 25 წელს")
  checkAge(25)
} catch (error) {
  console.error("დაჭერილი შეცდომა:", error.message)
}