# 1) შექმენი ცვლადი სადაც შეინახავ შენს საყვარელ სპორტის სახელს შემდეგ for ციკლით გადაუარეთ ცვლადს და გამოიტანეთ თქვენი სახელი ცალ-ცალკე.

# 2) შექმენი while ციკლი. სადაც გამოიტან რიცხვებს 1 დან 100 მდე და ყოველ იტერაციაზე უნდა დაუმატო 4-იანი.

# 3) შექმენი for ციკლი სადაც გამოიტან 1-დან  499 ის ჩათვლით ლუწ რიცხვებს.

# 4) დაწერე პროგრამა, რომელიც ითხოვს მომხმარებლის საყვარელ რიცხვს და არ ჩერდება მანამ, სანამ სწორ რიცხვს არ შეიყვანს.თუ მომხმარებელი შეიყვანს სხვა ციფრს, პროგრამამ უნდა სთხოვოს თავიდან შეიყვანოს.როდესაც სწორი რიცხვი იქნება შეყვანილი — პროგრამამ უნდა დაბეჭდოს, რომ ეს პასუხი სწორია.

#1
# favorite_sport = "Football"
# for i in favorite_sport:
#     print(i)


# #2
# num = 1
# while num <= 100:
#     print(num)
#     num += 4


# #3
# for i in range(0, 500, 2):
#     print(i)


# #4
# correct_number = 7
# user_input = int(input("Enter your favorite number: "))
# while user_input != correct_number:
#     user_input = int(input("Wrong number, please try again: "))
# print("Correct! Your favorite number is", correct_number)

# 5)for ციკლის საშუალებით 0 დან 20 მდე დაპრინტე ყველა ლუწი რიცხვი



#5
for i in range(0, 20, 2):
    print(i)

# 6)for ციკლის საშუალებით 1 დან 20 მდე დაპრინტე ყველა კენტი რიცხვი

# 7)while ციკლის დახმარებით 0 დან 20მდე დაპრინტეთ ყველა ლუწი რიცხვი

#6
for i in range(1, 20, 2):
    print(i)

#7
num = 0
while num <= 20:
    print(num)
    num += 2


