# 1)კომენტარებით ახსენით რა არის ფუნქცია 

# 2) ჩამოწერეთ ყველა ჩაშენებული ფუნქცია რაც იცით და მიუწერეთ გვერძე კომენტარებით მათი დანიშნულება

# -------------------------------------------------------------------------------------------------------------

#1
# ფუნქცია არის კოდის ბლოკი რომელიც ასრულებს კონკრეტულ ამოცანას და შეიძლება მრავალჯერ გამოვიყენოთ კოდის სხვადასხვა ნაწილებში

#2
# print() - გამოიყენება ტექსტის ან მნიშვნელობების ტერმინალში გამოსატანად
# input() - გამოიყენება მომხმარებლისგან მონაცემების შესაყვანად
# type() - გამოიყენება მონაცემის ტიპის გასაგებად
# str() - გამოიყენება მნიშვნელობი სტრინგად გადაქცევისთვის(ბრჭყალებში ჩასმა)
# int() - გამოიყენება მნიშვნელობი მთელი რიცხვად გადაქცევისთვის(ინტეჯერად გადაქცევისთვის)
# float() - გამოიყენება მნიშვნელობი ათწილადი რიცხვად გადაქცევისთვის
# range() - გამოიყენება რიცხვების სერიის შესაქმნელად
# bool() - გამოიყენება მნიშვნელობის ორი მნიშვნელობიდან ერთ ერთის გადაქცევისთვის (True ან False)







