# 1) კომენტარებით ახსენით რა არის სია და რამდენი მონაცემთა ტიპის შენახვა შეგვიძლია.

# 2) შექმენი სია სახელად names და შეინახეთ თქვენი ოჯახის წევრების სახელები. სააბოლოოდ დაბეჭდეთ 1-ლი და 3-მე ელემენტები.

# 3) შექმენი სია სახელად numbers და შეინახეთ 10-ი რენდომ რიცხვი. სააბოლოოდ 0-ლე ინდექსზე მდგომი ელემენტი გახადეთ თქვენი სახელი.

# 4) შექმენი სია სადაც შეინახავ ნებისმიერ მონაცემთა ტიპის მნიშვნელობას მაქსიმუმ 10 მნიშვნელობა რომ იყოს. საბოლოოდ დაბეჭდეთ კენტ ინდექსზე მდგომი ელემენტები.

#1
# სია არის მონაცემთა სტრუქტურა რომელიც საშუალებას გვაძლევს შევინახოთ ბევრი მნიშვნელობები ერთ ცვლადში. სიაში შეგვიძლია შევინახოთ სხვადასხვა მონაცემთა ტიპის მნიშვნელობები, როგორიცაა int, str, float და სხვა.

#2
names = ["Gega", "Mate", "Elmira", "Chabuka"]
print(names[0])
print(names[2])

#3
numbers = [5, 12, 23, 34, 45, 56, 67, 78, 89, 90]
numbers[0] = "Gega"
print(numbers)

#4

my_list = [1, 2, 3, 4, 5, 6]
count = 6
i = 1
while i < count:
    print(my_list[i])
    i = i + 2


