<<<<<<< HEAD
# 1)ახსენით კომენტარებით რა არის tuple და რით განსხვავდება სიისგან

# 2)შექმენი Tuple სადაც გექნება შენახული ადამიანის სახელები, შემდეგ გამოიტანე პირველი და ბოლო ელემენტის გარდა ყველა ელემენტი, სცადე slicing ის გამოყენება


# 3) კომენტარებით ახსენით tuple ს თითოეული მეთოდი რაომელი რას აკეთებს

# 4) კომენტარებით ახსენით დეტალურად ყველაფერი რასაც დაწერთ (კოდი ახსენით)



# 5)კომენტარებით ახსენით რა არის unpacking და მოიყვანეთ unpacking ზე 5 მაგალითი 


#1
# Tuple არის მონაცემთა ტიპი რომელიც გამოყენებაბა მრავალ ელემენტიანი მონაცემების შესანახად, ის არ არის შეცვლად, რაც ნიშნავს რომ მისი შექმნის შემდეგ მისი ელემენტები არ შეიძლება შეიცვალოს, დამატება ან წაშლა. სიისგან განსხვავებით, რომელიც mutable არის და მისი ელემენტები შეიძლება შეიცვალოს, დამატება ან წაშლა.


#2
names = ("Gega", "Oto", "Gio", "Dato")
sliced_names = names[1:3]
print(sliced_names)  
# ამ კოდში შევქმენით tuple სახელებით და გამოვიტანეთ პირველი და ბოლო ელემენტის გარდა ყველა ელემენტი slicing ის გამოყენებით.

#3
# count() ამ მეთოდში ფრჩხილებშ უნდა ჩავწეროთ ელემენტი რომლის რაოდენობასაც გვინდა გავიგოთ tuple ში. ის დააბრუნებს იმის რაოდენობას თუ რამდენჯერ არის ეს ელემენტი tuple ში
# index() ამ მეთოდში ფრჩხილებში უნდა ჩავწეროთ ელემენტი რომლის ინდექსსაც გვინდა გავიგოთ tuple ში. ის დააბრუნებს იმ ინდექსს სადაც ეს ელემენტი არის tuple ში

#5
# Unpacking არის პროცესი როდესაც tuple ში გადაცემული ელემენტები გადავანაწილოთ ცვლადებში
# მაგალითი 1
person = ("Gega", 25, "Chkhorotskhu")
person_age, person_name, person_city = person
print(person)

# მაგალითი 2
coordinates = (10, 20)
x, y = coordinates
print(coordinates)

# მაგალითი 3
rgb = (255, 0, 0)
red, green, blue = rgb
print(rgb)

# მაგალითი 4
date = (2026, 1, 4)
year, month, day = date
print(date)

# მაგალითი 5
cities = ("Tbilisi", "Batumi", "Zugdidi")
city1, city2, city3 = cities
print(cities)

=======
# 1)ახსენით კომენტარებით რა არის tuple და რით განსხვავდება სიისგან

# 2)შექმენი Tuple სადაც გექნება შენახული ადამიანის სახელები, შემდეგ გამოიტანე პირველი და ბოლო ელემენტის გარდა ყველა ელემენტი, სცადე slicing ის გამოყენება


# 3) კომენტარებით ახსენით tuple ს თითოეული მეთოდი რაომელი რას აკეთებს

# 4) კომენტარებით ახსენით დეტალურად ყველაფერი რასაც დაწერთ (კოდი ახსენით)



# 5)კომენტარებით ახსენით რა არის unpacking და მოიყვანეთ unpacking ზე 5 მაგალითი 


#1
# Tuple არის მონაცემთა ტიპი რომელიც გამოყენებაბა მრავალ ელემენტიანი მონაცემების შესანახად, ის არ არის შეცვლად, რაც ნიშნავს რომ მისი შექმნის შემდეგ მისი ელემენტები არ შეიძლება შეიცვალოს, დამატება ან წაშლა. სიისგან განსხვავებით, რომელიც mutable არის და მისი ელემენტები შეიძლება შეიცვალოს, დამატება ან წაშლა.


#2
names = ("Gega", "Oto", "Gio", "Dato")
sliced_names = names[1:3]
print(sliced_names)  
# ამ კოდში შევქმენით tuple სახელებით და გამოვიტანეთ პირველი და ბოლო ელემენტის გარდა ყველა ელემენტი slicing ის გამოყენებით.

#3
# count() ამ მეთოდში ფრჩხილებშ უნდა ჩავწეროთ ელემენტი რომლის რაოდენობასაც გვინდა გავიგოთ tuple ში. ის დააბრუნებს იმის რაოდენობას თუ რამდენჯერ არის ეს ელემენტი tuple ში
# index() ამ მეთოდში ფრჩხილებში უნდა ჩავწეროთ ელემენტი რომლის ინდექსსაც გვინდა გავიგოთ tuple ში. ის დააბრუნებს იმ ინდექსს სადაც ეს ელემენტი არის tuple ში

#5
# Unpacking არის პროცესი როდესაც tuple ში გადაცემული ელემენტები გადავანაწილოთ ცვლადებში
# მაგალითი 1
person = ("Gega", 25, "Chkhorotskhu")
person_age, person_name, person_city = person
print(person)

# მაგალითი 2
coordinates = (10, 20)
x, y = coordinates
print(coordinates)

# მაგალითი 3
rgb = (255, 0, 0)
red, green, blue = rgb
print(rgb)

# მაგალითი 4
date = (2026, 1, 4)
year, month, day = date
print(date)

# მაგალითი 5
cities = ("Tbilisi", "Batumi", "Zugdidi")
city1, city2, city3 = cities
print(cities)

>>>>>>> 217e13265442f77198ae78d8644909733855d02c
