// 1)ახსენით რა არის block scope, global scope და მოიძიეთ ინფორმაცია lexical scope ზე და ეგეც ახსენით

// 2)გააკეთეთ თითო მაგალითი თითო scope ზე და ახსენით კომენტარებით


// 1
// ცვლადები რომელიც არის შექმნილი კოდის ბლოკში ანუ ფუნქციაში ეწოდება block-scope და ის არის ხელმისაწვდომი მხოლოდ ფუნქციის შეგნით

// ცვლადები რომელიც არის შექმნილი კოდის ბლოკის გარეთ ანუ ფუნქციის გარეთ ეწოდება Global-scope ის არის ხელმისაწვდომი ყველგან როგორც ფუნქციაში ისე მის გარეთ

// 2
// Global
// let name = "Gega";

// function greet() {
//   console.log(name); აქაც მუშაობს
// }

// greet();
// console.log(name); და აქაც


// Block
// if (true) {
//   let age = 15;
//   console.log(age); // აქ მუშაობს
// }

// console.log(age); აქ არა