// 1)დააინსტალირეთ node ვისაც არ ჩაგიწერიათ

// 2)ახსენით რას აკეთებს npm init ბრძანება და ასევე ახსენით რაში არის საჭირო package.json ფაილი 

// 3) ახსენით რა განსხვავებაა CommonJS ის მოდულებსა და ES6 ის მოდულებს შორის, რომელს როდის ვიყენებთ

// 1
// გადმოწერილი მაქ

// 2
// npm init ეს არის ახალი პროექტის შექმნისას გადაცემული "ბრძანება" ანუ ამას ვიყენებთ როცა ახალ პროქეტს ვიწყებთ
// package.json ინახავს პროქეტის შესახებ ინფორმაციას სახელს, ვერსიას, ავტორს და ა.შ dependencies აქ იწერება ყველა საჭირო ბიბლიოთეკის სია რომელიც სხვა დეველოპერს სჭირდება ამის ნახვა გითჰაბზე შეუძლია სხვა დეველოპერს ასევე აქ განისაზღვრება პროქტის ტიპი თუ როგორი იქნება ის ან commonjs ან module იგივე es6

// 3
// 1. სიტაქსი: common: const module = require("./file"), es6: import module from "./file"
// 2. გამოყენება: common გამოიყენება უმეტესად backend ში სამუშაოდ ხოლო es6 frontend


import superhero from '@fakerjs/superhero';

console.log(superhero());