# 1) კომენტარებით ახსენი რას აკეთებს len() ფუნქცია და მოიყვანე მაგალითი.

# 2) კომენტარებით ახსენით დღევანდელ გაკვეთილზე ნასწავლი სიის მეთოდები და მოიყვანეთ თითო-თითო მაგალითები:
# .append()
# .insert()
# .pop()


# 3) შექმენი სია სადაც შეინახავთ ნებისმიერ მონაცემთა ტიპის მნიშვნელობას. საბოლოოდ სიის ბოლოს დაამატეთ თქვენი სახელი.

# 4) შექმენი სია სადაც შეინახავთ თქვენი ოჯახის წევრების სახელებს. საბოლოოდ 2-ე ინდექსზე მდგომი ელემენტი შეცვალეთ თქვენი საყვარელი ცხოველის სახელი.

# 5) შექმენით სია სადაც გექნებათ რიცხვები 1 დან 10-ის ჩათვლით. საბოლოოდ წაშალეთ 4-ე ინდექსზე მდგომი ელემენტი.

# ------------------------------------------------------------------------------------------------------

#1
# len() ფუნქცია გამოიყენება სიაში მოქცეული ელემენტების რაოდენობის დასათვლელად.
example_list = [1, 2, 3, 4, 5]
print(len(example_list))  

#2
# .append() მეთოდი გამოიყენება სიაში ახალი ელემენტის ჩასამატებლად რომელიც მოექცევა სიის ბოლოს.
my_list = [1, 2, 3]
my_list.append(4)
print(my_list)  
# .insert() მეთოდი გამოიყენება სიაში ახალი ელემენტის ჩასამატებლად კონკრეტულ ინდექსზე.
my_list = [1, 2, 3]
my_list.insert(1, "new element")
print(my_list)
# .pop() მეთოდი გამოიყენება სიიდან ელემენტის წასაშლელად და მისი მნიშვნელობის დაბრუნებისთვის.
my_list = [1, 2, 3]
removed_element = my_list.pop(1)
print(removed_element) 
print(my_list)  

#3
mixed_list = [1, "hello", 3.14, True]
mixed_list.append("Gega")
print(mixed_list) 

#4
family_members = ["Mom", "Dad", "Me", "Brother"]
family_members[2] = "Dog"
print(family_members)

#5
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
numbers.pop(4)
print(numbers)



