# 1) კომენტარის საშუალებით  დაწერე რომლებია მკაცრი და არამკაცრი ოპერატორები.

# 2) შექმენი ცვლადი და გადაეცი შენს მიერ  მოფიქრებული პაროლი, შემდეგ მომხმარებელს შეაყვანინე პაროლი და საბოლოოდ შეადარე უდრის თუ არა შენი პაროლი მომხმარებლის შემოყვანილ პაროლს.

# 3) შექმენი ცვლადი, სადაც შენახული იქნება შენი ასაკი. შემდეგ დაბეჭდე  არის თუ არა შენი ასაკი ნაკლები 10-ზე.

# 4) შექმენი 5 სხვადასხვა შედარება, რომლებიც ყველა დააბრუნებს True.

# 5) შექმენი 5 სხვადასხვა შედარება, რომლებიც ყველა დააბრუნებს False.


#1
# მკაცრი ოპერატორი

# ==
# !=
# >
# <

# არამკაცრი ოპერატორები

# <=
# >=

#2

sign_up_pass = "Gega2010"
login_pass = input("enter password: ")
print(sign_up_pass == login_pass)

#3

my_age = 15
print(15<10)

#4

print(15>10)
print(15>=15)
print(15<20)
print(15!=10)
print(15<=14)

#5

print(15>20)
print(15>=17)
print(15<14)
print(15<=14)
print(15!=15)