# 1) კომენტარებით ახსენით and და or ოპერატორი მოიყვანეთ ორ-ორი მაგალითი.

# 2) შექმენი ცვლადი სადაც შეინახავთ თქვენს სახელს, for ციკლით გადაუარეთ ცვლად და დაბეჭდეთ ცალ-ცალკე.

# 3) შექმენი while ციკლი სადაც გამოიტანს 1 დან 20 ამდე ლუწ რიცხვებს. 

# 4) შექმენი სია სადაც შეინახავ 10 ნებისმიერ მონაცემთა ტიპის ელემენტს, შენი დავალებაა წაშალო მეორე ინდექსზე მდგომი ელემენტი და სიის ბოლოს დაამატო საკუთარი სახელი.

# 5) შექმენით სია სადაც გექნებათ შენახული რიცხვები 1 დან 10-ის ჩათვლით, საბოლოოდ პირველ იდექსზე ჩაამატეთ თქვენი გვარი.

# --------------------------------------------------------------------------------------------------------------------------------------

#1
# and ოპერატორის დროს მხოლოდ თუ ორივე პირობა არის მართალი მხოლოდ მაშინ დააბრუნებს True-ს 
print(5 > 2 and 3 < 4)
print(10 == 10 and 5 == 3)
# 5 > 2 და 3 < 4 ორივე პირობა მართალია ამიტომ შედეგი იქნება True
# 10 == 10 მართალია, მაგრამ 5 == 3 არ არის მართალი ამიტომ შედეგი იქნება False

# or ოპერატორის დროს თ ერთი მაინც არის მართალი მაშნ დააბრუნებს True-ს
print(5 > 2 or 3 > 4)
print(10 == 5 or 5 == 3)
# 5 > 2 მართალია ამიტომ შედეგი იქნება True
# 10 == 5 და 5 == 3 ორივე არ არის მართალი ამიტომ შედეგი იქნება False

#2
name = "Gega"
for i in name:
    print(i)
# for ციკლით ჩვენ გადავუვლით მნიშნველობას რომელიც არის შენახული name-ში და თითოეულ ასოს ცალ-ცალკე დაბეჭდავს

#3
number = 1
while number <= 20:
    if number % 2 == 0:
        print(number)
    number += 1
# while ციკლი დაიწყება რიცხვით 1 და გაგრძელდება სანამ number იქნება 20 ან ნაკლები
# if ამოწმებს number იყოფა თუ არა ორზე სრულად ანუ ნაშთს არ გამოიტანს

#4
my_list = ["Georgia", 25, 6.7, True, "Pirtskhelava", 67, False, 6.67, 99, "Python"]
my_list.pop(2)
my_list.append("Gega")
print(my_list)
# my_list ში შევინახეთ 10 ელემენტი შემდეგ .pop მეთოდით ჩვენ წავშალეთ მეორე ინდექსზე მდგომი ელემენტი ამ შემთხვევაში 6.7 
# შემდეგ .append მეთოდით ჩვენ სიის ბოლოში დავამატეთ ჩემი სახელი "Gega" და ბოლოს დავბეჭდეთ განახლებული სია

#5
nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
nums.insert(1, "Pirtskhelava")
print(nums)
# nums ცვლადში შევინახეთ რიცხვები 1 დან 10-ის ჩათვლით და შემდეგ insert მეთოდის საშუალებით პირველ ინდექსზე ჩვენ ჩავამატეთ ჩემი გვარი "Pirtskhelava" და შემდეგ დავბეჭდეთ განახლებული სია

# --------------------------------------------------------------------------------------------------------------------------------------

# dot notaion არის 
