// 1) მოიძიე ინფორმაცია რა არის event loop და ახსენი დეტალურად

// 2)შექმენი ფუნქცია სახელად greet რომელიც იქნება ასინქრონული, გამოიძახე ეს ფუნქცია და .then მეთოდის გამოყენებით დაბეჭდე მიღებული შედეგი კონსოლში


// 1
// event loop საშუალებას იძლევა დავალებებები შესრულდეს ასინქორნულად იმის მიუხედავად თუ ის არ არის ასინქრონული event loop ის დახმარებით ის ახერხებს არ გაიჭედოს ხანგრძლივი დავალებების დროს

// 2
async function greet() {
    return "hello world"    
}

greet().then((res => {
    console.log(res)
}))