# 1) შეასრულეთ Sololearn ეს ორი თავი

# 2) შექმენი ცვლადი რომელსაც დაარქმევთ name-ს და მნიშვნელობად გადაეცით თქვენი სახელი, შექმენი მეორე ცვლადი რომელსაც დაარქმევთ LastName-ს და მნიშვნელობად გადაეცით თქვენი გვარი და საბოლოოდ დაპრინტეთ ცალ-ცალკე.

# 3) შექმენი ოთხი ცვლადი პირველ ცვლადს გადაეცით ინტეჯერი, მეორეს სტრინგი, მესამეს ფლოუთი, მეოთხეს ბულეანი და საბოლოოდ დაპრინტეთ ცალ-ცალკე

# 4) შექმენით იმდენი ცვლადი რამდენი ოჯახის წევრიც გყავთ. თითოეულს მნიშვნელობად მიანიჭეთ თქვენი ოჯახის წევრების ასაკი და საბოლოოდ შეკრიბეთ თითოეული ოჯახის წევრის ასაკი.

# 5) აუცილებლად გადახედეთ დღევანდელი გაკვეთილის ჩანაწერს.

#1
name = "Gega"
LastName = "Pirtskhelava"

print(name)
print(LastName)

#2
number = 10          # int (მთელი რიცხვი)
text = "Hello"       # str (ტექსტი)
decimal = 3.14       # float (ათწილადი)
is_student = True    # bool (ბულეანი)

print(number)
print(text)
print(decimal)
print(is_student)

#3
member1 = 15
member2 = 17
member3 = 55
member4 = 28

total_age = member1 + member2 + member3 + member4

print(total_age)