// 1)ასაკის შემოწმება
// დავალება: შექმენი ცვლადი age. გამოიყენე ternary operator-ი იმის დასადგენად, არის თუ არა ადამიანი სრულწლოვანი.

// თუ age არის 18 ან მეტი, დაუბეჭდე: "შენ ხარ სრულწლოვანი".

// თუ ნაკლებია, დაუბეჭდე: "შენ ხარ არასრულწლოვანი".



// 2)ლუწია თუ კენტი?
// დავალება: მოცემულია რიცხვი number.

// დაწერე კოდი, რომელიც შეამოწმებს რიცხვის ნაშთს 2-ზე გაყოფისას.

// თუ ნაშთი 0-ია, გამოიტანე ტექსტი "ლუწია", წინააღმდეგ შემთხვევაში – "კენტია".


// 3)ფასდაკლების სისტემა
// დავალება: გაქვს ცვლადი totalPrice (მაგალითად, 150 ლარი).

// თუ totalPrice აღემატება 100 ლარს, მიანიჭე ცვლადს discount მნიშვნელობა "20% ფასდაკლება".

// თუ ნაკლებია, მიანიჭე "ფასდაკლების გარეშე".



// 4)კვირის დღეები
// დავალება: გაქვს ცვლადი dayNumber, რომელიც შეიცავს რიცხვს 1-დან 7-მდე.

// გამოიყენე switch, რომ რიცხვის მიხედვით გამოიტანო კვირის შესაბამისი დღის სახელი (მაგალითად: 1 - "ორშაბათი", 2 - "სამშაბათი" და ა.შ.).

// აუცილებლად დაამატე default ბლოკი იმ შემთხვევისთვის, თუ რიცხვი 1-დან 7-მდე არ არის (მაგ: დაუბეჭდე "არასწორი რიცხვი").




// 5)შუქნიშნის ფერები
// დავალება: შექმენი ცვლადი color და მიანიჭე მას ტექსტური მნიშვნელობა ("წითელი", "ყვითელი" ან "მწვანე").

// case "წითელი": დაბეჭდე "გაჩერდი!"

// case "ყვითელი": დაბეჭდე "მოემზადე"

// case "მწვანე": დაბეჭდე "შეგიძლია იმოძრაო"

// default: დაბეჭდე "შუქნიშანი გაფუჭებულია"

// -----------------------------------------------------------------------------------------------------------------------------------------------

// 1
let age = 15
let message = (age >= 18) ? "შენ ხარ სრულწლოვანი": "შენ ხარ არასრულწლოვანი"
console.log(message)

// 2
let num = 9

if(num % 2 == 0){
    console.log("ლუწი რიცხვი")
}else{
    console.log("კენტი რიცხვი")
}

// 3
let totalPrice = 150;
let discount;

if (totalPrice > 100) {
    discount = "20% ფასდაკლება";
} else {
    discount = "ფასდაკლების გარეშე";
}

console.log(discount);

// 4
let dayNumber = 5
switch(dayNumber){
    case 1:
        console.log("ორშაბათი")
        break
    case 2:
        console.log("სამშაბათი")
        break
    case 3:
        console.log("ოთხშაბათი")
        break
    case 4:
        console.log("ხუთშაბათი")
        break
    case 5:
        console.log("პარასკევი")
        break
    case 6:
        console.log("შაბათი")
        break
    case 7:
        console.log("კვირა")
        break
    default:
        console.log("არასწორი რიცხვი")
}

// 5
let color = "მწვანე"
switch(color){
    case "წითელი":
        console.log("გაჩერდი!")
        break
    case "ყვითელი":
        console.log("მოემზადე")
        break
    case "მწვანე":
        console.log("შეგიძლია იმოძრავო")
        break
    default:
        console.log("შუქნიშანი გაფუჭებულია")
}