// 1) კომენტარებით ახსენით რა არის for ციკლიი.

// 2) რა განსვავებააა for in-სა და for of-ს შორის.

// 3) შემქენი for ციკლი სადაც გამოიტანთ 0 დან 20-მდე ლუწ რიცხვებს.

// 4) შექმენი ცვლადი სადაც შეინახავთ თქვენ სახელს და for in ის საშუალებით გამოიტანეთ თქვენი ცვლადის მნიშვნელობის ინდექსებიი.

// 5) შექმენი სია სადაც გექნება ნებისმიერი მონაცემთა ტიპის მნიშვნელობა for of ის საშუელებით გამოიტანე მხოლოდ პირველი მნიშვნელობა.

// 6) კომენტარის საშუელბით ახსენით რა გასნსვავებაა for ციკლსა და while ციკლს შორის.

// 7) შექმენი while ციკლი სადაც გამოიტან 1 დან 30-მდე კენტი რიცხვები, ზუსტად იგივე შედეგი გამოიტანე do while-ის საშუალებით.


// 1
// for ციკლის გამოყენების დროს ვიცით თუ რამდენი იტერაცია გვექნება განსხვავებით while loop ისგან

// 2
// for in ს როცა ვიყენებით ჩვენ გადავუვლით იმ ინდექსს რა ინდექსზეც დგას კონკრეტული ელემენტი იმ მომენტში

// 3
for (let i = 0; i <= 20; i += 2) {
    console.log(i);
}

// 4
let name = "Gega"
for(let i in name){
    console.log(i)
}

// 5
let lst = ["Gega", "GOA", 6.7, true]
for(let i of lst){
    console.log(lst)
    break
}

// 6
// როდესაც ვიყენებთ for ციკლს ვიცით თუ რამდენი გამეორება გვექნება ხოლო while ციკლის დროს არა

// 7
let i = 1
while(i <= 30){
    console.log(i)
    i += 2
}

let y = 1
do{
    console.log(y)
    y += 2
}while(y <= 30)