// 1) რა არის javascript და რისთვის გამოიყენება?

// 2) რა არის console.log()?

// 3) რა განსვავებაა let-სა და const-ით შექმნილ ცვლადებს შორის, მოიყვანეთ მაგალითი.

// 4) ჩამოწერეთ ჯავასკრიპტის მონაცემთა ტიპები და ახსენით კომენტარის სახით.

// 5) console.log() ის საშუალებით კონსოლში გამოიტანეთ 3-3 მაგალითი მათემატიკურ ოპერატორებზე.

// 6) კომენტარის სახით ახსენით დღევანდელ გაკვეთილზე ნასწავლი სტრინგის მეთოდები და მოიყვანეთ თითო-თითო მაგალითი:
// .charAt()
// .concat()
// .slice()
// .toUpperCase()
// .toLowerCase()
// .trim()
// .trimStart()
// .trimEnd()
// .repeat()
// .replace()
// .replaceAll()
// .split()
// .startsWith()
// .endsWith()

// ------------------------------------------------------------------------------------------------------------------------

// 1
// javascript შეგვიძლია გამოვიყენოთ საიტებზე როგორც frontend ში ასევე backend ში


// 2
// consol.log() დაახლოებით იგივეა რაც print თუმცა ამ დროს ტერმინალშ არ გამოდის, გამოდის იქ console ში რისი ნახვაც შეგვიძლია inspect ში საიტიდან 

// 3
// let და const აქ ვინახავთ ცვლადებს განსხვავებაა ის რომ როდესაც ცვლადს let ში ჩავწერთ მისი შეცვლა შეგვიძლია და const ში არ შეგვიძლია

// 4
// string - ყველაფერი რაც მოქცეულია ბრჭყალებში
// number - ყველა რიცხვი ასევე შეიძლება იყოს მთელი რიცხვები 
// boolean - true ან false
// null - ცარიელ მნიშვნელობა მაგრამ არის სპეციალურად ცარიელი
// undefined - ასევე ცარიელი მაგრამ სპეციალურად არა

// 5
// +
console.log(5 + 6)
console.log(7 + 8)
console.log(66 + 1)

// -
console.log(66 - 1)
console.log(7 - 1)
console.log(8 - 4)

// /
console.log(67 / 1)
console.log(8 / 2)
console.log(9 / 3)

// *
console.log(67 * 1)
console.log(2 * 2)
console.log(5 * 5)

//6
// .charAt() - დააბრუნებს სტრინგის იმ ასოს რომელიც იმყოფება კონკრეტულ ინდექსზე
// .concat() - აერთებს ერთმანეთთან სტრინგებს
// .slice() - იგივე სლაისინგი ოღონდ სხვა სინტაქსით
// .toUpperCase() - გადაააქცევს ტექსტს დიდ ასოებად
// .toLowerCase() - პატარა ასოებად
// .trim() - მოაშორებს space-ებს ყველგან
// .trimStart() - მოაშორებს space-ებს მხოლოდ დასაწყისში
// .trimEnd() - მოაშორებს space-ენს მხოლოდ ბოლოშ
// .repeat() - იმდენჯერ გამოიტანს კონკრეტულ სიტყვას რამდენიც ეწერება მნიშვნელობაში
// .replace() - გადაეცემა 2 მნიშვნელობა შეცვლის პირველს მეორეთი ოღონდ მხოლოდ პირველ შეხვედრილზე 
// .replaceAll() - გადაეცემა 2 მნიშვნელობა შეცვლის პირველს მეორეთი ოღონდ ყველას რაც შეხვდება
// .split() - String მეთოდი, რომელიც სტრინგს ყოფს ნაწილებად და აბრუნებს მასივს
// .startsWith() - იწყება თუ არა კონკრეტულით ამოწმებს
// .endsWith() - მთავრდება თუ არა კონკრეტულით ამოწმებს