# 1) კომენტარის სახით ახსენით რა არის მეთოდი და ახსენით მისი სინტაქსი.


# 2) კომენტარის სახით ახსენით დღევანდელ გაკვეთილზე ნასწავლი მეთოდები და მოიყვანე თითოეულზე თითო-თითო მაგალითი:
# upper()
# lower()
# capitalize()
# find()
# count()
# isupper()
# islower()
# startswith()
# endswith()
# isalnum()
# isalpha()
# isdigit()
# swapcase()

# -------------------------------------------------------------------------------------------------------------------------------------

#1
# მეთოდი არის ფუნქციის მსგავსი კონსტრუქცია, რომელიც დაკავშირებულია კონკრეტულ ობიექტთან და გამოიყენება ამ ობიექტის მონაცემებზე ოპერაციების შესასრულებლად. სინტაქსი: ცვლადი.მეთოდი("არგუმენტი") -> name.upper("gega")

#2
# upper() - ამ მეთოდის საშუალებით ტექსტის ყველა ასო გადაიყვანება დიდ ასოებად.
name = "gega"
print(name.upper())  # GЕGА

# lower() - ამ მეთოდის საშუალებით ტექსტის ყველა ასო გადაიყვანება პატარა ასოებად.
name = "GEGA"
print(name.lower()) # gega

# capitalize() - ამ მეთოდის საშუალებით ტექსტის პირველი ასო გადაიყვანება დიდ ასოდ, ხოლო დანარჩენი პატარა ასოებად.
name = "gega"
print(name.capitalize()) # Gega

# find() - ამ მეთოდის საშუალებით შეგვიძლია გავიგოთ ტექსტში კონკრეტული სიმბოლოს ან სიტყვის მდებარეობა ინდექსის სახით.
text = "hello world"
print(text.find("h")) # 0

# count() - ამ მეთოდის საშუალებით შეგვიძლია გავიგოთ რამდენჯერ მეორდება კონკრეტული სიმბოლო ან სიტყვა ტექსტში.
text = "hello world"
print(text.count("o")) # 2

# isupper() - ამ მეთოდის საშუალებით შეგვიძლია გავიგოთ არის თუ არა ტექსტის ყველა ასო დიდი თუ არის დაპრინტავს True, წინააღმდეგ შემთხვევაში False.
text = "HELLO"
print(text.isupper()) # True

# islower() - ამ მეთოდის საშუალებით შეგვიძლია გავიგოთ არის თუ არა ტექსტის ყველა ასო პატარა თუ არის დაპრინტავს True, წინააღმდეგ შემთხვევაში False.
text = "HELLO"
print(text.islower()) # False

# startswith() - ამ მეთოდის საშუალებით შეგვიძლია გავიგოთ იწყება თუ არა ტექსტი კონკრეტული სიმბოლოთი ან სიტყვით, თუ იწყება დაპრინტავს True, წინააღმდეგ შემთხვევაში False.
text = "hello world"
print(text.startswith("h")) # True

# endswith() - ამ მეთოდის საშუალებით შეგვიძლია გავიგოთ მთავრდება თუ არა ტექსტი კონკრეტული სიმბოლოთი ან სიტყვით, თუ მთავრდება დაპრინტავს True, წინააღმდეგ შემთხვევაში False.
text = "hello world"
print(text.endswith("o")) # False

# isalnum() - ამ მეთოდის საშუალებით შეგვიძლია გავიგოთ შეიცავს თუ არა ტექსტი მხოლოდ ასოებსა და ციფრებს, თუ შეიცავს დაპრინტავს True, წინააღმდეგ შემთხვევაში False.
text = "hello123"
print(text.isalnum()) # True

# isalpha() - ამ მეთოდის საშუალებით შეგვიძლია გავიგოთ შეიცავს თუ არა ტექსტი მხოლოდ ასოებს, თუ შეიცავს დაპრინტავს True, წინააღმდეგ შემთხვევაში False.
text = "123gega"
print(text.isalpha()) # False

# isdigit() - ამ მეთოდის საშუალებით შეგვიძლია გავიგოთ შეიცავს თუ არა ტექსტი მხოლოდ ციფრებს, თუ შეიცავს დაპრინტავს True, წინააღმდეგ შემთხვევაში False.
text = "12345"
print(text.isdigit()) # True

# swapcase() - ამ მეთოდის საშუალებით ტექსტში არსებული დიდი ასოები გადაიქცევა პატარა ასოებად და პატარა ასოები გადაიქცევა დიდ ასოებად.
text = "Hello World"
print(text.swapcase()) # hELLO wORLD

