// const users = [
//   { id: 1, name: "ანი", age: 22, active: true, score: 85 },
//   { id: 2, name: "ნიკა", age: 17, active: false, score: 45 },
//   { id: 3, name: "მარიამი", age: 25, active: true, score: 92 },
//   { id: 4, name: "გიორგი", age: 30, active: true, score: 70 },
//   { id: 5, name: "სალომე", age: 16, active: false, score: 55 }
// ];

// 1. .forEach() - მოქმედების შესრულება თითოეულზე:

//    -დავალება 1: გამოიტანე კონსოლში თითოეული მომხმარებლის სახელი.

//    -დავალება 2: დაბეჭდე კონსოლში მხოლოდ იმ მომხმარებლების სახელები, რომლებიც აქტიურები არიან (active: true).

//    -დავალება 3: თითოეული მომხმარებლისთვის კონსოლში გამოიტანე ტექსტი: "[სახელი] არის [ასაკი] წლის".

//    -დავალება 4: forEach-ის გამოყენებით თითოეულ ობიექტს პირდაპირ დაუმატე ახალი თვისება (property) passed: true ან passed: false, იმის მიხედვით, მათი ქულა (score) მეტია თუ არა 50-ზე.



// 2. .map() - ახალი მასივის შექმნა / ტრანსფორმაცია:

//   -დავალება 1: შექმენი ახალი მასივი, რომელშიც მხოლოდ მომხმარებლების სახელები იქნება (მაგ: ["ანი", "ნიკა", ...]).

//   -დავალება 2: შექმენი ახალი მასივი, სადაც თითოეული მომხმარებლის ქულა (score) გაზრდილი იქნება 10-ით.

//   -დავალება 3: შექმენი ახალი მასივი, რომელიც შეიცავს მხოლოდ ობიექტებს ორი თვისებით: name და age (სხვა ინფორმაცია ამოშალე).

//   -დავალება 4: შექმენი ახალი მასივი, სადაც გექნება ასეთი ფორმატის სტრინგები: "ანი - 85 ქულა".


// 3. .filter() - მონაცემების გაფილტვრა:

//   -დავალება 1: გაფილტრე და მიიღე მხოლოდ ის მომხმარებლები, რომლებიც სრულწლოვნები (18 წლის ან მეტის) არიან.

//   -დავალება 2: მიიღე ახალი მასივი მხოლოდ იმ მომხმარებლებით, რომლებიც არ არიან აქტიურები (active: false).
  
//   -დავალება 3: გაფილტრე მომხმარებლები, რომელთა ქულა 80-ზე მეტია.

//   -დავალება 4: მიიღე მხოლოდ ის მომხმარებლები, რომელთა სახელიც 4 ასოზე გრძელია.


// 4. .reduce() - ერთი მნიშვნელობის მიღება (ჯამი, დაჯგუფება):

//   -დავალება 1: იპოვე ყველა მომხმარებლის ქულების საერთო ჯამი.

//   -დავალება 2: იპოვე მომხმარებლების საშუალო ქულა (ჯერ იპოვე ჯამი და გაყავი მასივის სიგრძეზე: users.length).

//   -დავალება 3: დააჯგუფე მომხმარებლები active სტატუსის მიხედვით (აკუმულატორად აიღე ობიექტი: { active: [], inactive: [] }).


// 5. .some() - პირობის შემოწმება (აბრუნებს true / false):

//   -დავალება 1: შეამოწმე, არის თუ არა მასივში ერთი მაინც არასრულწლოვანი (18 წლამდე) მომხმარებელი.

//   -დავალება 2: შეამოწმე, აქვს თუ არა ვინმეს ზუსტად 100 ქულა.

//   -დავალება 3: შეამოწმე, არის თუ არა სიაში ვინმე, ვისი სახელიც არის "გიორგი".

// 1