# 1) კომენტარის სახით ახსენი, რა არის snake_case, camelCase და PascalCase.

# 2) კომენტარებით ახსენი, რა არის input და რა არის output. თითოეულზე მოიყვანე 2-2 მაგალითი.

# 3) მომხმარებელს შეაყვანინე შენი ასაკი და შექმენი ცვლადი snake_case-ით. შედეგად გამოიტანე თქვენს ასაკზე 1-დან 10-მდე ნებისმიერი რიცხვით გამოკლებული მნიშვნელობა.

# 4) შექმენი ცვლადი სახელად my_name და მომხმარებელს შეაყვანინე შენი სახელი.
# შექმენი მეორე ცვლადი სახელად user_name და მომხმარებელს შეაყვანინე შენი გვარი.
# საბოლოოდ, მოახდინე ამ ორ ცვლადზე კონკატინაცია.
# ```




 #1
# snake_case - ცვლადის დასახელების სტილი სადაც სიტყვები გამოყოგილია ქვედა ხაზით
# camelcase - ცვლადის დასახელების სტილი სადაც მეორე სიტყვა გამოყოფილია დიდი ასოთი
# pascalcase -ცვლადის დასახელების სტილი სადაც ყველა სიტყვა იწყება დიდი ასოთი

 #2
# input - "მონაცემები რომელსაც მართავს მომხარებელი ტერმინალის საშუალებით"

name = input("enter yout name:")



