# 1)აუცილებლად დარეგისტრირდით სოლოლერნზე(ჩანაწერის მიხედვით) და შეასრულეთ პირველი ორი თავი

# 2) print ის საშუალებით ტერმინალში გამოიტანეთ თქვენი საყვარელი სკოლის საგანი
# 3) print ის საშუალებით ტერმინალში გამოიტანეთ თქვენი საყვარელი ფილმი
# 4) print ის საშუალებით ტერმინალში გამოიტანეთ თქვენი ოჯახის წევრების სახელები
# 5) შექმენით ცვლადები სადაც შეინახავთ თქვენი ოჯახის წევრების სახელს და დაპრინტეთ ცალ-ცალკე

# 2) საყვარელი სკოლის საგანი
print("მათემატიკა")

# 3) საყვარელი ფილმი
print("The Matrix")

# 4) ოჯახის წევრების სახელები
print("დედა, მამა, და, ძმა")

# 5) ოჯახის წევრების სახელები ცვლადებში
mother = "ელმირა"
father = "ჭაბუკა"
me = "გეგა"
brother = "მათე"

print(mother)
print(father)
print(me)
print(brother)