# 1) კომენტარის სახით ახსენით რა არის პარამეტრი.

# 2) შექმენი ფუნქცია, რომელსაც ექნება ორი პარამეტრი.
# ფუნქციამ უნდა დააბრუნოს ამ ორი რიცხვის ჯამი.

# 3) შექმენი ფუნქცია, რომელსაც გადაეცემა ერთი პარამეტრი.
# ფუნქციამ უნდა შეამოწმოს, არის თუ არა ეს რიცხვი ლუწი ან კენტი. თუ ლუწია დაბეჭდეთ Even, ხოლო თუ კენტია Odd.

# 4) რა არის ამ კოდში ერორი არ შეამოწმოთ თქვენით იფიქრეთ:
# def hello(name):
#     print("gamarjoba",name)
# hello("nika","saba")



# ------------------------------------------------------------------------------------------------------

#1
# პარამეტრი არის ცვლადი რომელიც ფუნქციის განსაზღვრაში გამოიყენება და რომელიც ფუნქციის გამოძახებისას მიიღებს მნიშვნელობას.

#2
def sum_two_numbers(a, b):
    print(a + b)
result = sum_two_numbers(5,10)
print(result)

#3
def check_even_odd(number):
    if number % 2 == 0:
        print("Even")
    else:
        print("odd")
check_even_odd(7)

#4
def hello(name):
    print("gamarjoba",name)
hello("nika","saba")